[
	{
		"id": "jallikattu_reason_behind_it",
		"title": "JALLIKATTU",
		"author": "Krishnakumar Rajendran",
		"date": "2017-01-19T12:00:00Z",
		"imgSrc": "images/jallikattu_bull.jpg",
		"article": "<p><h1>What actually is Bull Embracing?</h1></p><p>A bull left out from the \"vaadi vasal\" (a gate) will have to be caught (by the hump) by those on ground for a specific distance (30 feet approx).</p><p><strong>Purpose</strong> - A strong and intellectual bull would escape from everyone and run away. Such bulls will be used for mating and thus produce a healthy cow/bull.</p><p><strong>When does it happen? </strong>It occurs only on the Pongal (Thanks giving harvesting festival) between the second and third week of January and this event is held only on one day of the festival.</p><p>Cattles are worshiped as god for helping farmers in various aspects.</p><p><strong>Reason behind ban</strong> - The bulls are tortured with iron rods and beaten, given alcohol.</p><div class='blog-image-article row'><figure class='col-md-5'><img src='images/jallikattu_bull_decoration.jpg' alt='bull decoration image'></figure><article class='col-md-7'><strong>Real fact </strong>- All said cruelty was there and an ordinance was passed by TN govt. In 2009 to monitor Jallikattu. Each bull will be examined by a group of vet. docs and monitored by  a govt. official. Those in the ground would be examined by the doc for fitness and won't be allowed if drunk. Moreover, during the event if the bull is found hurt by a human then immediately the bull is rescued and treated by the vet. Doctors and the foul maker will be disqualified from the event.</article></div><p><strong>What happens if banned</strong> - These native breeds are not used for farming and other activities. Their only job is to participate in Jallikattu and produce healthy calf. Since the sport is banned, farmers do not have a reason to raise them and cannot afford to maintain them. Hence they are sold to slaughter houses.</p><p><strong>How does Jallikattu help in the process?</strong>  The bulls used for mating need to be virile. During the mating season (which is typically after Pongal), these bulls need to be at the top of their game i.e. they must be secreting all the necessary male hormones, experience adrenaline rush and also a fast beating heart. This is where Jallikattu comes in picture. The time when the bull is released from the Vaadi Vaasal (the small narrow gate from which the bulls are released) and till the time it manages to reach the other end (if it is not subdued) causes it to experience a great adrenaline rush which then boosts its testosterone levels and also keeps its heart beating at a rate faster than normal levels. This increases their virility and this is one of the most fundamental of all necessities for selective breeding. Can this be done without an activity like Jallikattu? Possibly but then the number of mattings a bull can accomplish decreases significantly. Jallikattu helps in increasing this which is of utmost importance to a farmer's wellbeing. Also because artificial insemination is not adapted for native breeds, the banning of an event like Jallikattu will lead to these native breeds getting destroyed which would then force our hands to rely on artificial insemination the very process which the farmers shunned to begin with.</p><p>There were over 130 native breeds in southern India and now we are left with only 37!!!</p><p><strong>Reason for the decline</strong> – In places where jallikattu are not held, the male calves (which are essentially useless unless there is demand for tasks like ploughing) are slaughtered. But in places where Jallikattu is held, these calves are held on to for the purpose of showcasing them and establishing their superiority.</p><p>This is just not a tradition, it’s a way of preserving our native breeds!!!</p><p>After getting Jallikattu banned went on their own way. But these bulls do not have a way to be preserved and eventually land into a slaughter house.</p><p>For me it's a multibillion dollar business, wipe out the traditional animals and sell their stock here. Let’s do a reality check before coming to any conclusion.</p>",
		"intro": "The love between bull and humans, a tradion that has been followed 1000's of years to preserve native breeds and healthier society is under threat."
	},
	{
		"id": "amend_pca",
		"title": "#AMEND PCA",
		"author": "Krishnakumar Rajendran",
		"date": "2017-01-21T12:00:00Z",
		"imgSrc": "images/protest_main.jpg",
		"article": "<article ng-bind-html=\"post.article\" class=\"ng-binding\"><p></p><h1>What is AmendPCA?</h1><p></p><p>Need changes in Prevention of cruelty to animals ACT' 1960</p><p><strong>Section 11N</strong> -<b>Remove </b> Jallikattu from Animal Fighting. Here no animals fight and no one wrestles with a bull. To know what is Jallikattu click <a target='_blank' href='http://krishdev.com/Jallikattu/#/?id=jallikattu_reason_behind_it'>here</a></p><p><strong>Section 11/3 </strong><b> -Remove </b> Jallikattu from the Ban on Bulls from using them in Traditional and Cultural Practices. Bulls are a part of every Indian farmers life. In fact in regions like Madurai and Coimbatore bulls are being treated as one of their family member. There is a special day called Matu Pongal where every farmer thanks their cattle for helping them during the harvest.</p><p><strong>Special Rule No. 27</strong> Made for Military, Police & Scientist. <b>Add </b> Bulls under special section. No horse is interested in practising all the leeps and jumps carrying 100's of lbs on its back, likewise no rats and cats are meant to be tested with random medicines.</p><div class='blog-image-article row'><figure class='col-md-5'><img src='images/protest1.jpg' alt='student_image'></figure><article class='col-md-7'>Pongal was held last week. Hundreds of people who defied the ban to hold local competitions in parts of Tamil Nadu were arrested, triggering a massive backlash. Thousands of protesters, gathered at Chennai's Marina Beach since Monday, say they will not disperse till the ban is officially lifted. Youngsters, teenagers, elders, kids continue protest demanding Jallikattu on the straight 6th day. </article></div><div class='blog-image-article row'><article class='col-md-7'>The protest continues day and night. India has astonished by seeing such a unity among Tamilnadu people especially there is no gender, religious or cast biased with them. Everyone are so clear in their demands. More celebrities & politicians across India came forward in supporting and appreciating their unity. </article><figure class='col-md-5'><img src='images/protest2.jpg' alt='student_image'></figure></div><div class='blog-image-article row'><figure class='col-md-5'><img src='images/protest4.jpg' alt='student_image'></figure><article class='col-md-7'><b>Leaders</b>, everyone who participates in this are considered as leaders. This vib is not just in Chenaii and Coimbatore it is taking place in all over Tamilnadu. Students have ensured that the protests remain apolitical and peaceful. Many of the demonstrators have helped clean up litter along the beach. Politicians who tried to join the mass demonstration were asked to leave.</article></div><p>Tamil Nadu has used an executive order to clear Jallikattu - with some new restrictions - under a law that prevents cruelty to animals. States and centre both have legislative powers on this matter. Once the executive order is approved by President Mukherjee, it will be cleared by the Governor of Tamil Nadu, most likely no later than Sunday.</p><p>Prime Minister Narendra Modi in a meeting with Tamil Nadu Chief Minister O Panneerselvam on Thursday had indicated that though the centre cannot intervene while the Supreme Court is deciding on ending the ban, his government will support measures taken by the state.</p></article>",
		"intro": "AmendPCA, bills that should be passed and the reason for the protest."
	}

]
